norbiciat04/hoverboard_STM32F469I-DISCO/hoverboard_firmware_sw4/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal.h"

/* USER CODE BEGIN Includes */

#include <stdio.h>
#include <math.h>
#include "BLDC_Motors.h"
#include "tm_stm32_mpu6050.h"
#include "tm_stm32_delay.h"

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

TIM_HandleTypeDef htim12;

UART_HandleTypeDef huart3;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_TIM12_Init(void);
static void MX_I2C1_Init(void);
                                    
void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);
                                

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */

/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART3_UART_Init();
  MX_TIM12_Init();
  MX_I2C1_Init();

  /* USER CODE BEGIN 2 */

  //uart example
  uint8_t i = 9;
  uint8_t data[50]; // Tablica przechowujaca wysylana wiadomosc.
  uint16_t size = 0; // Rozmiar wysylanej wiadomosci
  size = sprintf(data, "kutaczan %d\r\n", i); // Stworzenie wiadomosci do wyslania oraz przypisanie ilosci wysylanych znakow do zmiennej size.


  //BLDC_Motors Init
  initializeBLDC_Motors(&htim12, TIM_CHANNEL_1, TIM_CHANNEL_2);
  setBLDC_MotorsPower(0,0);

  //MPU6050 Init

  TM_MPU6050_t MPU6050_Data0;
  TM_MPU6050_t MPU6050_Data1;
  uint8_t sensor1 = 0, sensor2 = 0;
  char str[120];

  // Initialize MPU6050 sensor 0, address = 0xD0, AD0 pin on sensor is low
  if (TM_MPU6050_Init(&MPU6050_Data0, TM_MPU6050_Device_0, TM_MPU6050_Accelerometer_8G, TM_MPU6050_Gyroscope_250s) == TM_MPU6050_Result_Ok) {
          // Display message to user
  //        TM_USART_Puts(USART1, "MPU6050 sensor 0 is ready to use!\n");
          size = sprintf(str, "MPU6050 sensor 0 is ready to use!\n", i);
    	  HAL_UART_Transmit(&huart3, str, size, 1000);
          // Sensor 1 OK
          sensor1 = 1;
  }

  // Initialize MPU6050 sensor 1, address = 0xD2, AD0 pin on sensor is high
  if (TM_MPU6050_Init(&MPU6050_Data1, TM_MPU6050_Device_1, TM_MPU6050_Accelerometer_8G, TM_MPU6050_Gyroscope_250s) == TM_MPU6050_Result_Ok) {
        // Display message to user
    //    TM_USART_Puts(USART1, "MPU6050 sensor 1 is ready to use!\n");
        size = sprintf(str, "MPU6050 sensor 1 is ready to use!\n", i);
  	  HAL_UART_Transmit(&huart3, str, size, 1000);
        // Sensor 2 OK
        sensor2 = 1;
  }



  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */

  /* USER CODE BEGIN 3 */
/*
      size = sprintf(data, "kutaczan %d\r\n", 4);
      HAL_UART_Transmit_IT(&huart3, data, size);
	  HAL_Delay(500);
*/


	       if (TM_DELAY_Time() >= 100) {
	           TM_DELAY_SetTime(0);
               TM_MPU6050_ReadAll(&MPU6050_Data0);
			   size = sprintf(str, "%d %d %d %d %d %d\r\n",
					   MPU6050_Data0.Accelerometer_X,
					   MPU6050_Data0.Accelerometer_Y,
					   MPU6050_Data0.Accelerometer_Z,
	                   MPU6050_Data0.Gyroscope_X,
	                   MPU6050_Data0.Gyroscope_Y,
	                   MPU6050_Data0.Gyroscope_Z
					   );
			   HAL_UART_Transmit_IT(&huart3, str, size);
	       }
/*
      //Every 500ms
       if (TM_DELAY_Time() >= 500) {
           // Reset time
           TM_DELAY_SetTime(0);

