norbiciat04/hoverboard_STM32F469I-DISCO/hoverboard_firmware_sw4/Src/main.c
           //vIf sensor 0 is connected
           if (sensor1) {
               // Read all data from sensor 0
               TM_MPU6050_ReadAll(&MPU6050_Data0);

               // Format data
               size = sprintf(str, "\r\n R \r\n 0 Acc: X:%d   Y:%d   Z:%d \r\n Gyr: X:%d   Y:%d   Z:%d \r\n Temp: %3.4f\r\n",
                   MPU6050_Data0.Accelerometer_X,
                   MPU6050_Data0.Accelerometer_Y,
                   MPU6050_Data0.Accelerometer_Z,
                   MPU6050_Data0.Gyroscope_X,
                   MPU6050_Data0.Gyroscope_Y,
                   MPU6050_Data0.Gyroscope_Z,
                   MPU6050_Data0.Temperature
               );

               // Show to usart
      //         TM_USART_Puts(USART1, str);
               HAL_UART_Transmit_IT(&huart3, str, size);
        //       HAL_UART_Transmit(&huart3, str, size, 500);
           }

           // If sensor 1 is connected
           if (sensor2) {
               // Read all data from sensor 1
               TM_MPU6050_ReadAll(&MPU6050_Data1);

               // Format data
               size = sprintf(str, "\r\n R \r\n 1 Acc: X:%d   Y:%d   Z:%d \r\n Gyr: X:%d   Y:%d   Z:%d \r\n Temp: %3.4f\r\n",
                   MPU6050_Data1.Accelerometer_X,
                   MPU6050_Data1.Accelerometer_Y,
                   MPU6050_Data1.Accelerometer_Z,
                   MPU6050_Data1.Gyroscope_X,
                   MPU6050_Data1.Gyroscope_Y,
                   MPU6050_Data1.Gyroscope_Z,
                   MPU6050_Data1.Temperature
               );

               // Show to usart
     //          TM_USART_Puts(USART1, str);
      //         HAL_UART_Transmit_IT(&huart3, str, size);
               HAL_UART_Transmit(&huart3, str, size, 500);
           }
       }

*/

/*
	  TM_MPU6050_ReadAccelerometer(&MPU6050_Data0);

       	   if(MPU6050_Data0.Accelerometer_Y>0)
       	   {
       		   R_MOT_FORWARD;
       		   Set_Right_Motor_Speed(MPU6050_Data0.Accelerometer_Y/40);
       	   } else if(MPU6050_Data0.Accelerometer_Y<0)
       	   {
       		   R_MOT_BACKWARD;
       		   Set_Right_Motor_Speed(MPU6050_Data0.Accelerometer_Y/-40);
       	   }
/*
	   TM_MPU6050_ReadAccelerometer(&MPU6050_Data1);

		   if(MPU6050_Data1.Accelerometer_Y>0)
		   {
			   L_MOT_BACKWARD;
			   Set_Left_Motor_Speed(MPU6050_Data1.Accelerometer_Y/40);
		   } else if(MPU6050_Data1.Accelerometer_Y<0)
		   {
			   L_MOT_FORWARD;
			   Set_Left_Motor_Speed(MPU6050_Data1.Accelerometer_Y/-40);
		   }
*/

 	//  setBLDC_MotorsPower(15, 15);

/*
	   Set_Left_Motor_Speed(1);
	   HAL_Delay(30);
	   Set_Left_Motor_Speed(5);
	   HAL_Delay(30);
	   Set_Left_Motor_Speed(10);
	   HAL_Delay(30);
	   Set_Left_Motor_Speed(15);
	   HAL_Delay(30);
	   Set_Left_Motor_Speed(20);
	   HAL_Delay(30);
	   Set_Left_Motor_Speed(25);
	   HAL_Delay(30);
	   Set_Left_Motor_Speed(30);
	   HAL_Delay(30);
	   Set_Left_Motor_Speed(35);
	   HAL_Delay(30);
	   Set_Left_Motor_Speed(40);
	   HAL_Delay(30);
	   Set_Left_Motor_Speed(45);
	   HAL_Delay(30);
	   Set_Left_Motor_Speed(50);
	   HAL_Delay(30);
	   Set_Left_Motor_Speed(55);
	   HAL_Delay(30);
	   Set_Left_Motor_Speed(60);
	   HAL_Delay(30);
	   Set_Left_Motor_Speed(65);
	   HAL_Delay(30);
	   Set_Left_Motor_Speed(70);
	   HAL_Delay(30);
	   Set_Left_Motor_Speed(75);
	   HAL_Delay(30);
	   Set_Left_Motor_Speed(80);
	   HAL_Delay(30);
	   Set_Left_Motor_Speed(90);
	   HAL_Delay(30);
	   Set_Left_Motor_Speed(100);
	   HAL_Delay(5000);
	   Set_Left_Motor_Speed(90);
	   HAL_Delay(50);
	   Set_Left_Motor_Speed(80);
	   HAL_Delay(50);
	   Set_Left_Motor_Speed(70);
	   HAL_Delay(50);
	   Set_Left_Motor_Speed(60);
	   HAL_Delay(50);
	   Set_Left_Motor_Speed(50);
	   HAL_Delay(50);
	   Set_Left_Motor_Speed(40);
	   HAL_Delay(50);
	   Set_Left_Motor_Speed(30);
	   HAL_Delay(50);
	   Set_Left_Motor_Speed(10);
	   HAL_Delay(50);
	   Set_Left_Motor_Speed(5);
	   HAL_Delay(1000);
	   /*
	   Set_Left_Motor_Speed(15);
	   HAL_Delay(50);
	   Set_Left_Motor_Speed(16);
	   HAL_Delay(50);
	   Set_Left_Motor_Speed(17);
	   HAL_Delay(50);
	   Set_Left_Motor_Speed(18);
	   HAL_Delay(50);
	   Set_Left_Motor_Speed(17);
	   HAL_Delay(50);
	   Set_Left_Motor_Speed(16);
	   HAL_Delay(50);
	   Set_Left_Motor_Speed(15);
	   HAL_Delay(10);
	   Set_Left_Motor_Speed(14);
	   HAL_Delay(10);
	   Set_Left_Motor_Speed(13);
	   HAL_Delay(10);
	   Set_Left_Motor_Speed(12);
	   HAL_Delay(10);
	   Set_Left_Motor_Speed(11);
	   HAL_Delay(10);
	   Set_Left_Motor_Speed(10);
	   HAL_Delay(10);
	   Set_Left_Motor_Speed(9);
	   HAL_Delay(10);
	   Set_Left_Motor_Speed(8);
	   HAL_Delay(10);
	   Set_Left_Motor_Speed(7);
	   HAL_Delay(10);
	   Set_Left_Motor_Speed(6);
	   HAL_Delay(10);
	   Set_Left_Motor_Speed(5);
	   HAL_Delay(10);
	   Set_Left_Motor_Speed(4);
	   HAL_Delay(10);
	   Set_Left_Motor_Speed(3);
	   HAL_Delay(10);
	   Set_Left_Motor_Speed(2);
	   HAL_Delay(10);
*/

	  /*
	  HAL_UART_Transmit_IT(&huart3, data, size);
	  HAL_Delay(1000);




	  setBLDC_MotorsDIR(1, 1);
	  setBLDC_MotorsPower(15, 15);
*/


	  /*
//	  setBLDC_MotorsDIR(0, 0);
//	  HAL_Delay(1000);
//	  setBLDC_MotorsDIR(1, 1);
//	  HAL_Delay(1000);

	  setBLDC_MotorsDIR(1, 0);
	  HAL_Delay(1000);

//	  send_string("Right");
	  setBLDC_MotorsDIR(0, 1);
	  */

  }
  /* USER CODE END 3 */

}

/** System Clock Configuration
*/
void SystemClock_Config(void)
{

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /**Configure the main internal regulator output voltage 
    */
  __HAL_RCC_PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE3);

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = 16;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Initializes the CPU, AHB and APB busses clocks 
    */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
  {
    _Error_Handler(__FILE__, __LINE__);
  }

    /**Configure the Systick interrupt time 
    */
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

    /**Configure the Systick 
    */
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

